Revit 2024 API
ClipPlane Class
 A set of parameters representing a clip plane in DirectContext3D.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class ClipPlane : IDisposable
Visual Basic
Public Class ClipPlane _
	Implements IDisposable
Visual C++
public ref class ClipPlane : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.ClipPlane
See Also
ClipPlane Members
Autodesk.Revit.DB.DirectContext3D Namespace